# Домашнее задание 2 

Необходимо реализовать схему, указанную в hw_diagram.pdf

## Описание таблиц 
PeopleStatus - Описание возможных статусов людей, которые есть в университете (Студент, Преподаватель).
Faculties - Описание факультетов, которые есть в университете (KIB, IT, и т.д.).
People - Информация о людях в университете (Имя, почта, ссылка на факультет, ссылка на статус).
Classes - Описание возможных классов в университете (название (Математический анализ) и ссылка на факультет).
Semesters - Справочник семестров факультета(например, Осень2016, '2016-01-01', '2016-12-31').
ClassesSchedule - Расписание классов (ссылки на семестр, преподавателя и курс, день недели, время начала).
StudentsSchedule - Таблица, описывающая, какой студент ходит на какой курс.

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite://
Done.

[]

## Создание таблиц
Напишет ниже скрипты по созданию таблиц с учетом всех внешних ключей.

In [3]:
%%sql 
DROP TABLE IF EXISTS Semesters;
CREATE TABLE Semesters
(
    id integer(0,0) NOT NULL primary key, 
    shortname varchar(0,0) NOT NULL,
    date_start date(0,0) NOT NULL,
    date_end date(0,0) NOT NULL
);

 * sqlite://
Done.
Done.

[]

In [4]:
%%sql 
DROP TABLE IF EXISTS Classes;
CREATE TABLE Classes
(
    id integer(0,0) NOT NULL primary key, 
    description varchar(0,0)NOT NULL ,
    fac_id integer(0,0) NOT NULL,
    FOREIGN KEY (fac_id) REFERENCES Faculties(id)
);

 * sqlite://
Done.
Done.

[]

In [5]:
%%sql 
DROP TABLE IF EXISTS Faculties;
CREATE TABLE Faculties
(
    id integer(0,0) NOT NULL primary key, 
    name varchar(0,0)  NOT NULL
);

 * sqlite://
Done.
Done.

[]

In [6]:
%%sql 
DROP TABLE IF EXISTS People;
CREATE TABLE People
(
    id integer(0,0)NOT NULL primary key, 
    name varchar(0,0)NOT NULL,
    email varchar(0,0),
    fac_id integer(0,0)NOT NULL,
    status_id integer(0,0)NOT NULL ,
    FOREIGN KEY (fac_id) REFERENCES Faculties(id)
    FOREIGN KEY (status_id) REFERENCES PeopleStatus(id)
);

 * sqlite://
Done.
Done.

[]

In [7]:
%%sql 
DROP TABLE IF EXISTS ClassesSchedule;
CREATE TABLE ClassesSchedule
(
    id integer(0,0)  primary key, 
    class_id integer(0,0) NOT NULL,
    teacher_id integer(0,0) NOT NULL,
    semester_id integer(0,0) NOT NULL,
    week_day integer(0,0) NOT NULL,
    time_start varchar(0,0) NOT NULL,
    FOREIGN KEY (class_id) REFERENCES Classes(id)
    FOREIGN KEY (semester_id) REFERENCES Semesters(id)
    FOREIGN KEY (teacher_id) REFERENCES People(id)
);

 * sqlite://
Done.
Done.

[]

In [8]:
%%sql 
DROP TABLE IF EXISTS StudentsSchedule;
CREATE TABLE StudentsSchedule
(
    student_id integer(0,0)NOT NULL,
    classesschedule_id integer(0,0)NOT NULL,
    primary key (student_id,classesschedule_id)
    FOREIGN KEY (classesschedule_id) REFERENCES ClassesSchedule(id)
    FOREIGN KEY (student_id) REFERENCES People(id)
);

 * sqlite://
Done.
Done.

[]

In [9]:
%%sql 
DROP TABLE IF EXISTS Peoplestatus;
CREATE TABLE Peoplestatus
(
    id integer(0,0) NOT NULL primary key, 
    name varchar(0,0) NOT NULL
);

 * sqlite://
Done.
Done.

[]

## Добавление записей в таблицы
Приведите примеры добавления записей в каждую из таблиц

In [10]:
%%sql
insert Into Peoplestatus(id, name) VALUES (1, 'student');
insert Into Peoplestatus(id, name) VALUES (2, 'teacher');
insert Into Peoplestatus(id, name) VALUES (3, 'postgraduate');
insert Into Peoplestatus(id, name) VALUES (4, 'undergraduates');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
insert Into Faculties(id, name) VALUES (1, 'KIB');
insert Into Faculties(id, name) VALUES (2, 'IT');
insert Into Faculties(id, name) VALUES (3, 'Economics');
insert Into Faculties(id, name) VALUES (4, 'TXT');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
insert Into Semesters(id, shortname, date_start,date_end) VALUES (1, 'first', (01.09),(09.02));
insert Into Semesters(id, shortname, date_start,date_end) VALUES (2, 'second', (10.02),(31.09));
insert Into Semesters(id, shortname, date_start,date_end) VALUES (3, 'third',(1.09),(09.02));

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
insert Into Classes(id, description, fac_id) VALUES (1, 'Матан', 1);
insert Into Classes(id, description, fac_id) VALUES (2, 'Линал', 1);
insert Into Classes(id, description, fac_id) VALUES (3, 'Прога', 1);
insert Into Classes(id, description, fac_id) VALUES (4, 'БД', 1);
insert Into Classes(id, description, fac_id) VALUES (5, 'Дифуры', 1);
insert Into Classes(id, description, fac_id) VALUES (6, 'Дифгем', 1);
insert Into Classes(id, description, fac_id) VALUES (7, 'Методы Матана', 1);
insert Into Classes(id, description, fac_id) VALUES (8, 'Дискра', 1);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
insert Into People(id, name, email, fac_id, status_id) values (1, 'Danya','danya@mail.ru', 1, 1);
insert Into People(id, name, email, fac_id, status_id) values (2, 'Tanya','tanya@mail.ru', 2, 3);
insert Into People(id, name, email, fac_id, status_id) values (3, 'Sanya','tanya@mail.ru', 3, 4);
insert Into People(id, name, email, fac_id, status_id) values (4, 'Stroganov Andrey Valentinovich','SAV@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (5, 'Kchalaev Timur Sultanovich','KTS@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (6, 'Shatina Albina Victorovna','SAV@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (7, 'Bakanchev Nikita I','BNI@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (8, 'Adamovich Olga Maratovna','AOM@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (9, 'Shelepin Alexey Leonidovich','ALSH@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (10, 'Parfenov Denis Vasilievich','PDV@mail.ru', 1, 2);
insert Into People(id, name, email, fac_id, status_id) values (11, 'Anya','Anya@mail.ru', 1, 1);
insert Into People(id, name, email, fac_id, status_id) values (12, 'Vanya','Vanya@mail.ru', 1, 1);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (1, 1, 9, 1, 1, '9:00');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (2, 4, 7, 1, 1, '10:30');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (3, 6, 1, 1, 1, '13:10');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (4, 8, 4, 1, 1, '14:50');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (5, 5, 5, 1, 1, '16:30');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (6, 7, 6, 1, 1, '18:00');
insert Into ClassesSchedule(id,class_id,teacher_id,semester_id,week_day,time_start) VALUES (7, 3, 10, 1, 2, '13:10');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,1);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,2);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,3);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,4);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,5);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,6);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (1,7);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (11,1);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (11,3);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (11,5);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (11,4);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (12,2);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (12,7);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (12,3);
insert Into StudentsSchedule(student_id,classesschedule_id) VALUES (12,6);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
select* 
FROM People

 * sqlite://
Done.

[(1, 'Danya', 'danya@mail.ru', 1, 1),
 (2, 'Tanya', 'tanya@mail.ru', 2, 3),
 (3, 'Sanya', 'tanya@mail.ru', 3, 4),
 (4, 'Stroganov Andrey Valentinovich', 'SAV@mail.ru', 1, 2),
 (5, 'Kchalaev Timur Sultanovich', 'KTS@mail.ru', 1, 2),
 (6, 'Shatina Albina Victorovna', 'SAV@mail.ru', 1, 2),
 (7, 'Bakanchev Nikita I', 'BNI@mail.ru', 1, 2),
 (8, 'Adamovich Olga Maratovna', 'AOM@mail.ru', 1, 2),
 (9, 'Shelepin Alexey Leonidovich', 'ALSH@mail.ru', 1, 2),
 (10, 'Parfenov Denis Vasilievich', 'PDV@mail.ru', 1, 2),
 (11, 'Anya', 'Anya@mail.ru', 1, 1),
 (12, 'Vanya', 'Vanya@mail.ru', 1, 1)]

In [18]:
%%sql
select* 
FROM PeopleStatus

 * sqlite://
Done.

[(1, 'student'), (2, 'teacher'), (3, 'postgraduate'), (4, 'undergraduates')]

In [19]:
%%sql
select* 
FROM Faculties

 * sqlite://
Done.

[(1, 'KIB'), (2, 'IT'), (3, 'Economics'), (4, 'TXT')]

In [20]:
%%sql
select* 
FROM Semesters

 * sqlite://
Done.

[(1, 'first', 1.09, 9.02),
 (2, 'second', 10.02, 31.09),
 (3, 'third', 1.09, 9.02)]

In [21]:
%%sql
select* 
FROM StudentsSchedule

 * sqlite://
Done.

[(1, 1),
 (1, 2),
 (1, 3),
 (1, 4),
 (1, 5),
 (1, 6),
 (1, 7),
 (11, 1),
 (11, 3),
 (11, 5),
 (11, 4),
 (12, 2),
 (12, 7),
 (12, 3),
 (12, 6)]

In [22]:
%%sql
select* 
FROM ClassesSchedule

 * sqlite://
Done.

[(1, 1, 9, 1, 1, '9:00'),
 (2, 4, 7, 1, 1, '10:30'),
 (3, 6, 1, 1, 1, '13:10'),
 (4, 8, 4, 1, 1, '14:50'),
 (5, 5, 5, 1, 1, '16:30'),
 (6, 7, 6, 1, 1, '18:00'),
 (7, 3, 10, 1, 2, '13:10')]

In [23]:
%%sql
select* 
FROM Classes

 * sqlite://
Done.

[(1, 'Матан', 1),
 (2, 'Линал', 1),
 (3, 'Прога', 1),
 (4, 'БД', 1),
 (5, 'Дифуры', 1),
 (6, 'Дифгем', 1),
 (7, 'Методы Матана', 1),
 (8, 'Дискра', 1)]

In [24]:
%%sql
select pe.name, fa.name, se.shortname, cl_sh.time_start,cl.description
from StudentsSchedule st_sc
join ClassesSchedule cl_sh on st_sc.classesschedule_id = cl_sh.id
join Classes cl on cl_sh.class_id = cl.id
join Semesters se on cl_sh.semester_id = se.id
join People pe on st_sc.student_id = pe.id
join People peo on cl_sh.teacher_id = peo.id
join Faculties fa on pe.fac_id = fa.id
join PeopleStatus pe_st on pe.status_id = pe_st.id

 * sqlite://
Done.

[('Danya', 'KIB', 'first', '9:00', 'Матан'),
 ('Danya', 'KIB', 'first', '10:30', 'БД'),
 ('Danya', 'KIB', 'first', '13:10', 'Дифгем'),
 ('Danya', 'KIB', 'first', '14:50', 'Дискра'),
 ('Danya', 'KIB', 'first', '16:30', 'Дифуры'),
 ('Danya', 'KIB', 'first', '18:00', 'Методы Матана'),
 ('Danya', 'KIB', 'first', '13:10', 'Прога'),
 ('Anya', 'KIB', 'first', '9:00', 'Матан'),
 ('Anya', 'KIB', 'first', '13:10', 'Дифгем'),
 ('Anya', 'KIB', 'first', '16:30', 'Дифуры'),
 ('Anya', 'KIB', 'first', '14:50', 'Дискра'),
 ('Vanya', 'KIB', 'first', '10:30', 'БД'),
 ('Vanya', 'KIB', 'first', '13:10', 'Прога'),
 ('Vanya', 'KIB', 'first', '13:10', 'Дифгем'),
 ('Vanya', 'KIB', 'first', '18:00', 'Методы Матана')]